uhnp/src/DataProcessors/тн_ЗагрузкаСверхлимитныхРазговоров/тн_ЗагрузкаСверхлимитныхРазговоров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>тн_ЗагрузкаСверхлимитныхРазговоров</name>
  <comment>№000041528</comment>
  <attributes>
    <name>ОрганизацияДляЗагрузкиСверхлимитныхРазговоров</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Статья5421</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяПрочиеРасчетыСРаботниками</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиАктивовПассивов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СозданныеДокументы</name>
    <attributes>
      <name>ПУиПА</name>
      <type>
        <types>DocumentRef.ПриобретениеУслугПрочихАктивов</types>
      </type>
    </attributes>
    <attributes>
      <name>СФ</name>
      <type>
        <types>DocumentRef.СчетФактураПолученный</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

uhnp/src/Enums/ТипыНалогообложенияНДС/ТипыНалогообложенияНДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыНалогообложенияНДС</name>
  <enumValues>
    <name>НалоговыйАгентПоНДС</name>
  </enumValues>
  <enumValues>
    <name>ПоФактическомуИспользованию</name>
  </enumValues>
  <enumValues>
    <name>ПродажаНаЭкспорт</name>
  </enumValues>
  <enumValues>
    <name>ПродажаНеОблагаетсяНДС</name>
  </enumValues>
  <enumValues>
    <name>ПродажаОблагаетсяЕНВД</name>
  </enumValues>
  <enumValues>
    <name>ПродажаОблагаетсяНДС</name>
  </enumValues>
  <enumValues>
    <name>ЭкспортСырьевыхТоваровУслуг</name>
  </enumValues>
  <enumValues>
    <name>ЭкспортНесырьевыхТоваров</name>
  </enumValues>
  <enumValues>
    <name>ВводОСВЭксплуатацию</name>
  </enumValues>
  <enumValues>
    <name>ОпределяетсяРаспределением</name>
  </enumValues>
  <enumValues>
    <name>ОблагаетсяНДСУПокупателя</name>
  </enumValues>
  <enumValues>
    <name>ПроизводствоСДЦ</name>
  </enumValues>
  <enumValues>
    <name>ЭлектронныеУслуги</name>
  </enumValues>
  <enumValues>
    <name>РеализацияРаботУслугНаЭкспорт</name>
  </enumValues>
  <enumValues>
    <name>ПродажаПоПатенту</name>
  </enumValues>
  <enumValues>
    <name>РеверсивноеОбложениеНДС</name>
  </enumValues>
  <enumValues>
    <name>ОблагаетсяНДССМежценовойРазницы</name>
  </enumValues>
  <enumValues>
    <name>Космос</name>
  </enumValues>
  <enumValues>
    <name>ПродажаОблагаетсяНДСВСтранеЕАЭС</name>
  </enumValues>
  <enumValues>
    <name>ЛьготноеНалогообложениеНДСНаУСН</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Documents/СчетФактураПолученный/СчетФактураПолученный.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СчетФактураПолученный</name>
  <basedOn>Document.ПриобретениеТоваровУслуг</basedOn>
  <basedOn>Document.ПриобретениеУслугПрочихАктивов</basedOn>
  <basedOn>Document.ВозвратТоваровОтКлиента</basedOn>
  <basedOn>Document.ВыкупВозвратнойТарыУПоставщика</basedOn>
  <basedOn>Document.ОтчетКомиссионера</basedOn>
  <basedOn>Document.ОтчетПереработчика</basedOn>
  <basedOn>Document.ВыкупПринятыхНаХранениеТоваров</basedOn>
  <basedOn>Document.ОтчетПереработчика2_5</basedOn>
  <registerRecords>AccumulationRegister.ДвиженияПоНДС</registerRecords>
  <registerRecords>AccumulationRegister.ПрочиеРасходы</registerRecords>
  <registerRecords>InformationRegister.ОтражениеДокументовВРеглУчете</registerRecords>
  <registerRecords>AccumulationRegister.НДСПредъявленный</registerRecords>
  <registerRecords>AccumulationRegister.ФактическиеДанныеБюджетирования</registerRecords>
  <registerRecords>AccountingRegister.МеждународныйБезКорреспонденции</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>InformationRegister.ОтражениеДокументовВМеждународномУчете</registerRecords>
  <registerRecords>AccountingRegister.Международный</registerRecords>
  <registerRecords>AccumulationRegister.НДСЗаписиКнигиПродаж</registerRecords>
  <registerRecords>AccumulationRegister.НДСЗаписиКнигиПокупок</registerRecords>
  <registerRecords>InformationRegister.ЖурналУчетаСчетовФактур</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Исправление</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерИсправления</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИсправления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Корректировочный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетФактураОснование</name>
    <type>
      <types>DocumentRef.СчетФактураПолученный</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолученВЭлектронномВиде</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>КодВидаОперации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоставления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтнестиКПредыдущемуОтчетномуКварталу</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаписиКнигиПокупок</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СоставленКомиссионеромОтИмениПродавца</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СводныйКомиссионный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КодВидаОперацииНаУменьшение</name>
    <comment>Код вида операции при уменьшении стоимости (количества)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СводныйКорректировочный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИННКонтрагента</name>
    <type>
      <types>DefinedType.ИНН</types>
    </type>
  </attributes>
  <attributes>
    <name>КППКонтрагента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыМеждуОрганизациями</types>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
      <types>CatalogRef.ДоговорыАренды</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>РучнаяКорректировкаЖурналаСФ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РучнаяКорректировкаСуммДокумента</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаписиКнигиПродаж</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>тн_УПД</name>
    <comment>ВЗ №000041271</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>тн_ЗаписьДополнительногоЛиста</name>
    <comment>Выполнение задач №000041973</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>тн_КорректируемыйПериод</name>
    <comment>Выполнение задач №000041973</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>тн_ЗаписыватьНомерДатуВхВДокументОснования</name>
    <comment>№000044034</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>тн_НалогообложениеНДС</name>
    <comment>№000046864</comment>
    <type>
      <types>EnumRef.ТипыНалогообложенияНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>тн_KindFacture</name>
    <comment>Выполнение задач №000047912</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДокументыОснования</name>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DefinedType.ОснованиеСчетФактураПолученный</types>
      </type>
    </attributes>
    <attributes>
      <name>ХозяйственнаяОперация</name>
      <type>
        <types>EnumRef.ХозяйственныеОперации</types>
      </type>
    </attributes>
    <attributes>
      <name>ИсходныйДокумент</name>
      <type>
        <types>DocumentRef.СчетФактураПолученный</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаУвеличение</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаУменьшение</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДСУвеличение</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДСУменьшение</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаКомиссия</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДСКомиссия</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаУвеличениеКомиссия</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаУменьшениеКомиссия</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДСУвеличениеКомиссия</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДСУменьшениеКомиссия</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>тн_ГуидДокументаОснования</name>
      <comment>Выполнение задач №000043965</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидЦенности</name>
      <type>
        <types>EnumRef.ВидыЦенностей</types>
      </type>
    </attributes>
    <attributes>
      <name>ПринятоКВычетуНДСДоВводаОстатков</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДСДоВводаОстатков</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Продавцы</name>
    <attributes>
      <name>Продавец</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ИННПродавца</name>
      <type>
        <types>DefinedType.ИНН</types>
      </type>
    </attributes>
    <attributes>
      <name>КПППродавца</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>9</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

uhnp/src/Catalogs/СтавкиНДС/СтавкиНДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СтавкиНДС</name>
  <comment>Ставки НДС</comment>
  <predefined>
    <items>
      <name>БезНДС</name>
    </items>
  </predefined>
  <attributes>
    <name>ПеречислениеСтавкаНДС</name>
    <type>
      <types>EnumRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>РасчетнаяСтавка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СоответствующаяБазоваяСтавка</name>
    <type>
      <types>CatalogRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>СоответствующаяРасчетнаяСтавка</name>
    <type>
      <types>CatalogRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>Ставка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Страна</name>
    <type>
      <types>CatalogRef.СтраныМира</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонецПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТипыНалогообложенияНДС</name>
    <attributes>
      <name>ТипНалогообложенияНДС</name>
      <type>
        <types>EnumRef.ТипыНалогообложенияНДС</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

uhnp/src/DataProcessors/тн_ЗагрузкаСверхлимитныхРазговоров/Forms/Форма/Module.bsl
&НаКлиенте
Процедура ВыборФайлаНачалоВыбора(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбораФайла.Заголовок = "Выбор файла данных с кодами Статей расходов ЕРП УХ";
	ДиалогВыбораФайла.Фильтр = "Табличный документ (*.xls?,*.xlsx)|*.xls;*.xlsx";    
	
	ОповещениеВыбора = Новый ОписаниеОповещения("ОкончаниеВыбораФайла", ЭтотОбъект);
	
	ДиалогВыбораФайла.Показать(ОповещениеВыбора);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьДанныеНажатие(Элемент)
	
	ФайлДанных = Новый Файл(ВыборФайла);
	
	Если ФайлДанных.Существует() Тогда
		Попытка
			
			Excel = Новый COMОбъект("Excel.Application");
			Excel.WorkBooks.Open(ВыборФайла);
				
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Открытие файла Microsoft Excel...'"));

			SheetExcel = Excel.Sheets(1);
			КоличествоСтрок 	= SheetExcel.UsedRange.rows.count()-1;
			КоличествоКолонок 	= SheetExcel.UsedRange.columns.count();
			
		Исключение
			ТекстСообщения = НСтр("ru = 'В процессе открытия файла, произошла ошибка - %1'");
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, ОписаниеОшибки());
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);

			Excel.Application.Quit();
			Возврат;
		КонецПопытки;		
		
		Попытка     
			ПериодРегистрации = Дата(СокрЛП(Excel.Cells(1, 1).Value));
			СтавкаНДС = СокрЛП(Excel.Cells(1, 2).Value);
			
			Данные = Новый Массив; // Для передачи на сервер, и обработки данных.
			
			//с 7 столбца по три - данные по одному оператору    
			Стб=7;                                                              
			Оператор = СокрЛП(Excel.Cells(3, Стб+1).Value);    
			Пока ЗначениеЗаполнено(Оператор) Цикл                   
				Строка = 6; // Данные начинаются с 6 строки.
				Пока Строка <= КоличествоСтрок Цикл
					УИНПодразделения =  СокрЛП(Excel.Cells(Строка, 3).Value);
					Если ЗначениеЗаполнено(УИНПодразделения) Тогда
						СтруктураДанных = Новый Структура;
						СтруктураДанных.Вставить("Подразделение", СокрЛП(Excel.Cells(Строка, 3).Value)); 
						
						СтруктураДанных.Вставить("Оператор", Оператор);
						СтруктураДанных.Вставить("Договор", СокрЛП(Excel.Cells(4, Стб+1).Value));    
						СтруктураДанных.Вставить("Удержано", Число(СокрЛП(Excel.Cells(Строка, Стб).Value)));
						СтруктураДанных.Вставить("Затраты", Число(СокрЛП(Excel.Cells(Строка, Стб+1).Value)));    
						СтруктураДанных.Вставить("НДСЗатрат", Число(СокрЛП(Excel.Cells(Строка, Стб+2).Value)));  
						Данные.Добавить(СтруктураДанных);	
					Иначе 
						ТекстСообщения = НСтр("ru = 'Не заполнен УИН подразделения в строке %1, документы по нему созданы не будут'");
						ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, Строка(Строка));
						ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения); 
					КонецЕсли;
					Строка = Строка + 1;
						
				КонецЦикла;    
				Стб = Стб+3;
				Оператор = СокрЛП(Excel.Cells(3, Стб+1).Value);
			КонецЦикла;
			
			Если Данные.Количество()=0 Тогда
				ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не удалось получить данные из файла. Проверьте правильность заполнения файла'"));
				Возврат;
			КонецЕсли;
			ЗагрузитьДанныеНаСервере(Данные, ПериодРегистрации, СтавкаНДС);
			
		Исключение
			ТекстСообщения = НСтр("ru = 'В процессе обработки файла, произошла ошибка - %1'");
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, ОписаниеОшибки());
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
			Excel.Application.Quit();
			Возврат;
		КонецПопытки;
		
		Excel.Application.Quit();

		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Обработка успешно завершена.'"));
		
	Иначе	
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Выберите файл!'"));
		Возврат;	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьДанныеНаСервере(Данные, ПериодРегистрации, СтавкаНДС)
	
	ВсеОК = Истина;
	
	//проверка заполенности         
	Если Не ЗначениеЗаполнено(Объект.ОрганизацияДляЗагрузкиСверхлимитныхРазговоров) Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Не заполнено значение ""Организация""'"));
		ВсеОк = Ложь;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Статья5421) Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Не заполнено значение ""Статья 5.4.2.1""'"));
		ВсеОк = Ложь;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.СтатьяПрочиеРасчетыСРаботниками) Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Не заполнено значение ""Статья Прочие расчеты с работниками""'"));
		ВсеОк = Ложь;
	КонецЕсли;    
	
	Если Не ВсеОк Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеТЗ = Новый ТаблицаЗначений;   
	ДанныеТЗ.Колонки.Добавить("ОблагаетсяНДС");
	ДанныеТЗ.Колонки.Добавить("Подразделение");
	ДанныеТЗ.Колонки.Добавить("Оператор");
	ДанныеТЗ.Колонки.Добавить("Договор");
	ДанныеТЗ.Колонки.Добавить("Удержано");
	ДанныеТЗ.Колонки.Добавить("Затраты");
	ДанныеТЗ.Колонки.Добавить("НДСЗатрат");
	
    Для Каждого Элемент Из Данные Цикл
		НовСтр = ДанныеТЗ.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, Элемент);
		УИНПодразделения = Новый УникальныйИдентификатор(СокрЛП(Элемент.Подразделение));      
		ПодразделениеСсылка = Справочники.СтруктураПредприятия.ПолучитьСсылку(УИНПодразделения);   
		НовСтр.Подразделение = ПодразделениеСсылка;
		НовСтр.ОблагаетсяНДС = НЕ ПодразделениеСсылка.тн_ДеятельностьНеОблагаетсяНДС;
	КонецЦикла;
	
	НачатьТранзакцию();
	
	Попытка  
        ПараметрыПУиПА = Новый Структура("НалогообложениеНДС, СтрокиОператора, Комментарий");
		ПараметрыПУиПА.Вставить("ПериодРегистрации", ПериодРегистрации);
		ПараметрыПУиПА.Вставить("ОрганизацияДляЗагрузкиСверхлимитныхРазговоровЗУП", Объект.ОрганизацияДляЗагрузкиСверхлимитныхРазговоров);
		ПараметрыПУиПА.Вставить("СтатьяПрочиеРасчетыСРаботникамиЗУП", Объект.СтатьяПрочиеРасчетыСРаботниками);
		ПараметрыПУиПА.Вставить("СтавкаНДС", Справочники.СтавкиНДС.НайтиПоНаименованию(СтавкаНДС));
		ПараметрыПУиПА.Вставить("Статья5421ЗУП", Объект.Статья5421);
		ПараметрыПУиПА.Вставить("Валюта", Константы.ВалютаРегламентированногоУчета.Получить());    
		Операторы = ДанныеТЗ.Скопировать();
		Операторы.Свернуть("Оператор");		   
		Для Каждого Оператор Из Операторы Цикл
			//головная организация
			Отбор = Новый Структура("Оператор,ОблагаетсяНДС", Оператор.Оператор, Истина);
			СтрокиОператора = ДанныеТЗ.НайтиСтроки(Отбор);
			Если СтрокиОператора.Количество()>0 Тогда
				ПараметрыПУиПА.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;
				ПараметрыПУиПА.СтрокиОператора = СтрокиОператора;   
				ПараметрыПУиПА.Комментарий = "Мобильная связь за " + Формат(ПериодРегистрации, "ДФ=ММММ") + " месяц Основное подразделение";
				СтруктураРезультат = СоздатьПУПАиСФ(ПараметрыПУиПА); 
				Если СтруктураРезультат.Успешно Тогда
					Если ЗначениеЗаполнено(СтруктураРезультат.ПУиПА) ИЛИ  ЗначениеЗаполнено(СтруктураРезультат.СФ) Тогда            
						НовСтр = Объект.СозданныеДокументы.Добавить();
						НовСтр.ПУиПА = СтруктураРезультат.ПУиПА;
						НовСтр.СФ = СтруктураРезультат.СФ;
					КонецЕсли;
				ИначеЕсли ТранзакцияАктивна() Тогда
					ОтменитьТранзакцию();
					Объект.СозданныеДокументы.Очистить();
					ОбщегоНазначения.СообщитьПользователю(СтруктураРезультат.ОписаниеОшибки);
					Возврат;        
				КонецЕсли;
			КонецЕсли;
			
			//филиал центр
			Отбор = Новый Структура("Оператор,ОблагаетсяНДС", Оператор.Оператор, Ложь);
			СтрокиОператора = ДанныеТЗ.НайтиСтроки(Отбор);     
			Если СтрокиОператора.Количество()>0 Тогда
				ПараметрыПУиПА.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС;
				ПараметрыПУиПА.СтрокиОператора = СтрокиОператора;
				ПараметрыПУиПА.Комментарий = "По необлагаемой деятельности, Филиал Центр";
				СтруктураРезультат = СоздатьПУПАиСФ(ПараметрыПУиПА); 
				Если СтруктураРезультат.Успешно Тогда
					Если ЗначениеЗаполнено(СтруктураРезультат.ПУиПА) ИЛИ  ЗначениеЗаполнено(СтруктураРезультат.СФ) Тогда            
						НовСтр = Объект.СозданныеДокументы.Добавить();
						НовСтр.ПУиПА = СтруктураРезультат.ПУиПА;
						НовСтр.СФ = СтруктураРезультат.СФ;
					КонецЕсли;
				ИначеЕсли ТранзакцияАктивна() Тогда
					ОтменитьТранзакцию();
					Объект.СозданныеДокументы.Очистить();
					ОбщегоНазначения.СообщитьПользователю(СтруктураРезультат.ОписаниеОшибки);
					Возврат;        
				КонецЕсли;    
			КонецЕсли;
		КонецЦикла;
		
		Если СтруктураРезультат.Успешно Тогда	
			ЗафиксироватьТранзакцию();
		ИначеЕсли ТранзакцияАктивна() Тогда
			ОтменитьТранзакцию();
			Объект.СозданныеДокументы.Очистить();
		КонецЕсли;
		
	Исключение
		Если ТранзакцияАктивна() Тогда
			ОтменитьТранзакцию();
			Объект.СозданныеДокументы.Очистить();
		КонецЕсли;
		
		ТекстСообщения = НСтр("ru = 'В процессе записи данных, произошла ошибка (Транзакция отменена, данные не сохранены)- %1'");
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, ОписаниеОшибки());
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		
	КонецПопытки;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СоздатьПУПАиСФ(ПараметрыПУиПА)
	
	//НАЧАЛО: Гимадиев Марат 17.02.2023 Выполнение задач №000044438 
	// Блок перенесен "как есть" выше, а ниже закомментирован (сначала выполнеем провеку)
	
	СтруктураРезультат = Новый Структура("Успешно, ОписаниеОшибки, ПУиПА, СФ", Истина, "", "");
	Договор = Справочники.ДоговорыКонтрагентов.НайтиПоРеквизиту("Номер", СокрЛП(ПараметрыПУиПА.СтрокиОператора[0].Договор));
	//Договор = Справочники.ДоговорыКонтрагентов.НайтиПоНаименованию(СокрЛП(ПараметрыПУиПА.СтрокиОператора[0].Договор), Истина);
	Если Не ЗначениеЗаполнено(Договор) Тогда
		СтруктураРезультат.Успешно = Ложь;
		ТекстСообщения = НСтр("ru = 'В процессе записи данных, произошла ошибка (Транзакция отменена, данные не сохранены)- Не найден Договор %1'");
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, ПараметрыПУиПА.СтрокиОператора[0].Договор);
		СтруктураРезультат.ОписаниеОшибки = ТекстСообщения;
		Возврат СтруктураРезультат;
	КонецЕсли;          
	//КОНЕЦ: Гимадиев Марат 17.02.2023 Выполнение задач №000044438
	
	//проверить уже созданные
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПриобретениеУслугПрочихАктивов.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ПриобретениеУслугПрочихАктивов КАК ПриобретениеУслугПрочихАктивов
		|ГДЕ
		|	НЕ ПриобретениеУслугПрочихАктивов.ПометкаУдаления
		|	И ПриобретениеУслугПрочихАктивов.Дата = &Дата 
		//НАЧАЛО: Гимадиев Марат 17.02.2023 Выполнение задач №000044438 
		|	И ПриобретениеУслугПрочихАктивов.Договор = &Договор 
		//КОНЕЦ: Гимадиев Марат 17.02.2023 Выполнение задач №000044438
		|	И ПриобретениеУслугПрочихАктивов.Комментарий ПОДОБНО &Комментарий";
	
	Запрос.УстановитьПараметр("Дата", ПараметрыПУиПА.ПериодРегистрации);
	Запрос.УстановитьПараметр("Комментарий", ПараметрыПУиПА.Комментарий);
	//НАЧАЛО: Гимадиев Марат 17.02.2023 Выполнение задач №000044438 
	Запрос.УстановитьПараметр("Договор", Договор);
	//КОНЕЦ: Гимадиев Марат 17.02.2023 Выполнение задач №000044438
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ДокОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		ДокОбъект.ПометкаУдаления = Истина;
		ДокОбъект.Проведен = Ложь;
		ДокОбъект.Записать();
	КонецЦикла;
	
	//НАЧАЛО: Гимадиев Марат 17.02.2023 Выполнение задач №000044438    
	// Блок перенесен выше, т.к проверку необходимо выполнить в первую очередь
	
	//СтруктураРезультат = Новый Структура("Успешно, ОписаниеОшибки, ПУиПА, СФ", Истина, "", "");
	//Договор = Справочники.ДоговорыКонтрагентов.НайтиПоРеквизиту("Номер", СокрЛП(ПараметрыПУиПА.СтрокиОператора[0].Договор));
	////Договор = Справочники.ДоговорыКонтрагентов.НайтиПоНаименованию(СокрЛП(ПараметрыПУиПА.СтрокиОператора[0].Договор), Истина);
	//Если Не ЗначениеЗаполнено(Договор) Тогда
	//	СтруктураРезультат.Успешно = Ложь;
	//	ТекстСообщения = НСтр("ru = 'В процессе записи данных, произошла ошибка (Транзакция отменена, данные не сохранены)- Не найден Договор %1'");
	//	ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, ПараметрыПУиПА.СтрокиОператора[0].Договор);
	//	СтруктураРезультат.ОписаниеОшибки = ТекстСообщения;
	//	Возврат СтруктураРезультат;
	//КонецЕсли;          
	//КОНЕЦ: Гимадиев Марат 17.02.2023 Выполнение задач №000044438
	
	ДокументПУ = Документы.ПриобретениеУслугПрочихАктивов.СоздатьДокумент();
	ДокументПУ.Дата = ПараметрыПУиПА.ПериодРегистрации;
	ДокументПУ.Организация = ПараметрыПУиПА.ОрганизацияДляЗагрузкиСверхлимитныхРазговоровЗУП;
	ДокументПУ.Договор = Договор;   
	КонтрагентДоговора = Договор.Контрагент;
	ДокументПУ.Контрагент = КонтрагентДоговора;
	ДокументПУ.Партнер = КонтрагентДоговора.Партнер;    
	ДокументПУ.ЦенаВключаетНДС = Истина;
	ДокументПУ.НалогообложениеНДС = ПараметрыПУиПА.НалогообложениеНДС;
	ДокументПУ.ЗакупкаПодДеятельность = ПараметрыПУиПА.НалогообложениеНДС;
	ДокументПУ.Валюта = ПараметрыПУиПА.Валюта;
	ДокументПУ.ВалютаВзаиморасчетов = ПараметрыПУиПА.Валюта;
	ДокументПУ.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ЗакупкаУПоставщика;
	ДокументПУ.НаименованиеВходящегоДокумента = "Акт";  
	ДокументПУ.Комментарий = ПараметрыПУиПА.Комментарий;
	
	Для Каждого Строка Из ПараметрыПУиПА.СтрокиОператора Цикл   
		Сотрудники = Строка.Подразделение.тн_ФизическоеЛицо;	
		ДанныеНастройки = НастройкаСчетовУчетаКлиентСервер.СоставНастройкиСчетовУчета();
		ДанныеНастройки.СчетУчета = ПланыСчетов.Хозрасчетный.РасчетыПоПрочимОперациям;
		ДанныеНастройки.Субконто1 = Сотрудники;
		НастройкаСчетаУчета = НастройкаСчетовУчетаСервер.НоваяНастройкаСчетовУчета(ДанныеНастройки);
		Если Строка.Удержано>0 Тогда
			НовСтр = ДокументПУ.Расходы.Добавить();
			НовСтр.Содержание = "Удержания связь";
			НовСтр.Количество = 1;
			НовСтр.Цена = Строка.Удержано;
			НовСтр.Сумма = Строка.Удержано;   
			НовСтр.СуммаВзаиморасчетов = Строка.Удержано;
			НовСтр.СуммаСНДС = Строка.Удержано;
			НовСтр.СтавкаНДС = Справочники.СтавкиНДС.БезНДС;
			НовСтр.АналитикаРасходов = Сотрудники;
			НовСтр.Подразделение = Справочники.СтруктураПредприятия.тн_ОтражатьТолькоВРегламентированномУчете;
			НовСтр.СтатьяРасходов = ПараметрыПУиПА.СтатьяПрочиеРасчетыСРаботникамиЗУП;
			НовСтр.НастройкаСчетовУчета = НастройкаСчетаУчета.Ссылка;
			НовСтр.АналитикаАктивовПассивов = Сотрудники;      
			Если Не ОбщегоНазначения.СсылкаСуществует(Строка.Подразделение) Тогда
				СтруктураРезультат.Успешно = Ложь;
				ТекстСообщения = НСтр("ru = 'По строке %1 не нашлось Подразделение'");
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, НовСтр.НомерСтроки);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
				СтруктураРезультат.ОписаниеОшибки = ТекстСообщения;
				Возврат СтруктураРезультат;
			КонецЕсли;
		КонецЕсли;
		
		Если Строка.Затраты>0 Тогда
			НовСтрЗатраты = ДокументПУ.Расходы.Добавить();
			НовСтрЗатраты.Содержание = "Услуги сторонних организаций 26";
			НовСтрЗатраты.Количество = 1;
			НовСтрЗатраты.Цена = Строка.Затраты;
			НовСтрЗатраты.Сумма = Строка.Затраты;
			НовСтрЗатраты.СуммаВзаиморасчетов = Строка.Затраты;
			НовСтрЗатраты.СуммаСНДС = Строка.Затраты;
			НовСтрЗатраты.СуммаНДС = Строка.НДСЗатрат;   
			НовСтрЗатраты.СуммаНДСВзаиморасчетов = Строка.НДСЗатрат;
			НовСтрЗатраты.СтавкаНДС = ПараметрыПУиПА.СтавкаНДС;       
			
			НовСтрЗатраты.АналитикаРасходов = Строка.Подразделение;
			НовСтрЗатраты.Подразделение = Строка.Подразделение.Родитель;
			НовСтрЗатраты.СтатьяРасходов = ПараметрыПУиПА.Статья5421ЗУП;
			Если Не ОбщегоНазначения.СсылкаСуществует(Строка.Подразделение) Тогда
				СтруктураРезультат.Успешно = Ложь;
				ТекстСообщения = НСтр("ru = 'По строке %1 не нашлось Подразделение'");
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, НовСтрЗатраты.НомерСтроки);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
				СтруктураРезультат.ОписаниеОшибки = ТекстСообщения;
				Возврат СтруктураРезультат;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;  
	
	Если ДокументПУ.Расходы.Количество()>0 Тогда
		
		ДокументПУ.Записать(); 
		
		СтруктураРезультат.ПУиПА = ДокументПУ.Ссылка;
		
		//Создание СФ
		СтруктураЗаполненияСФ = Новый Структура;
		СтруктураЗаполненияСФ.Вставить("ДокументОснование", ДокументПУ.Ссылка);
		СтруктураЗаполненияСФ.Вставить("Корректировочный", Ложь);
		
		НовыйДокументСчетФактураПолученный = Документы.СчетФактураПолученный.СоздатьДокумент();
		НовыйДокументСчетФактураПолученный.Заполнить(СтруктураЗаполненияСФ);
		НовыйДокументСчетФактураПолученный.ПолученВЭлектронномВиде = Ложь;
		НовыйДокументСчетФактураПолученный.Дата = ДокументПУ.Дата;
		НовыйДокументСчетФактураПолученный.ДатаЗаписиКнигиПродаж = НовыйДокументСчетФактураПолученный.Дата;
		НовыйДокументСчетФактураПолученный.ДатаСоставления = НовыйДокументСчетФактураПолученный.Дата;
		НовыйДокументСчетФактураПолученный.Корректировочный = Ложь;					
		//Запись СФ в транзакции 
		НовыйДокументСчетФактураПолученный.Записать(РежимЗаписиДокумента.Запись); 
		СтруктураРезультат.СФ = НовыйДокументСчетФактураПолученный.Ссылка;
		
	КонецЕсли;
			
	Возврат СтруктураРезультат;
	
КонецФункции

&НаКлиенте
Процедура ОкончаниеВыбораФайла(ВыбранныеФайлы, Параметры) Экспорт

	Если ВыбранныеФайлы <> Неопределено Тогда
		ВыборФайла = ВыбранныеФайлы[0];	
	КонецЕсли;

КонецПроцедуры
